20260308202504-borgad_jungle_safari_11_oct_2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-08 Sun 17:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Borgad Jungle Safari – 11 Oct 2025</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Borgad Jungle Safari – 11 Oct 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1979974">Trek Overview</a></li>
<li><a href="#orga023cd1">Schedule &amp; Companions</a></li>
<li><a href="#org7a00b56">Route Information</a></li>
<li><a href="#orgb85ddc2">Historical / Mythological Background</a></li>
<li><a href="#org68cb142">Key Landmarks &amp; Attractions</a></li>
<li><a href="#orgea52490">Experience &amp; Observations</a></li>
<li><a href="#org4c786d7">Facilities &amp; Amenities</a></li>
<li><a href="#org68b9231">Local Notes</a></li>
<li><a href="#org8672f61">Photos &amp; Media</a></li>
<li><a href="#org5853ccc">Reflection</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1979974" class="outline-2">
<h2 id="org1979974">Trek Overview</h2>
<div class="outline-text-2" id="text-org1979974">
<ol class="org-ol">
<li>Trek Name:</li>
<li>Region:</li>
<li>Range:</li>
<li>Base Village:</li>
<li>Height from MSL (ft):</li>
<li>Type:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> hill fort</li>
<li class="off"><code>[&#xa0;]</code> forest trail</li>
<li class="off"><code>[&#xa0;]</code> plateau</li>
</ul></li>
<li>Difficulty Level:</li>
<li class="off"><code>[&#xa0;]</code> easy</li>
<li class="off"><code>[&#xa0;]</code> moderate</li>
<li class="off"><code>[&#xa0;]</code> difficult</li>
<li>Best Season:</li>
<li class="off"><code>[&#xa0;]</code> winter</li>
<li class="off"><code>[&#xa0;]</code> summer</li>
<li class="off"><code>[&#xa0;]</code> monsoon</li>
<li>Time taken to Climb [hrs]:</li>
<li>Water Availability:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
<li>Suitable For:</li>
<li class="off"><code>[&#xa0;]</code> beginners</li>
<li class="off"><code>[&#xa0;]</code> regular trekkers</li>
<li class="off"><code>[&#xa0;]</code> families</li>
</ol>
</div>
</div>

<div id="outline-container-orga023cd1" class="outline-2">
<h2 id="orga023cd1">Schedule &amp; Companions</h2>
<div class="outline-text-2" id="text-orga023cd1">
<ol class="org-ol">
<li>Date:</li>
<li>Team Members:</li>
<li>Wake-up Time:</li>
<li>Left Home:</li>
<li>Start Point / Meeting Place:</li>
<li>Route Start Time:</li>
<li>Return Time:</li>
<li>Key Stops / Temples / Checkpoints:
<ul class="org-ul">
<li></li>

<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org7a00b56" class="outline-2">
<h2 id="org7a00b56">Route Information</h2>
<div class="outline-text-2" id="text-org7a00b56">
<ol class="org-ol">
<li>Route from Base City:</li>
<li>Final Village Distance km:</li>
<li>Public Transport Availability:</li>
<li>Parking / Auto / Petrol:</li>
</ol>
</div>
</div>

<div id="outline-container-orgb85ddc2" class="outline-2">
<h2 id="orgb85ddc2">Historical / Mythological Background</h2>
<div class="outline-text-2" id="text-orgb85ddc2">
<ol class="org-ol">
<li>Historical Importance:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Legends / Myths:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Nearby Heritage / Religious Sites:
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org68cb142" class="outline-2">
<h2 id="org68cb142">Key Landmarks &amp; Attractions</h2>
<div class="outline-text-2" id="text-org68cb142">
<ol class="org-ol">
<li>Temples:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Structures (Bastions, Caves, Gates, etc.):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Viewpoints (Ranges / Dams visible):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Not to Miss:
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgea52490" class="outline-2">
<h2 id="orgea52490">Experience &amp; Observations</h2>
<div class="outline-text-2" id="text-orgea52490">
<ol class="org-ol">
<li>Weather / Terrain:</li>
<li>Notable Sights:</li>
<li>Personal Experience:</li>
<li>Vibe / Mood of Place:</li>
<li>Tips for Future Trekkers:</li>
</ol>
</div>
</div>

<div id="outline-container-org4c786d7" class="outline-2">
<h2 id="org4c786d7">Facilities &amp; Amenities</h2>
<div class="outline-text-2" id="text-org4c786d7">
<ol class="org-ol">
<li>Food / Water Availability:</li>
<li>Accommodation / Prasadam Timings:</li>
<li>Shops / Auto Repair / Petrol Info:</li>
<li>Guide Needed:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
</ol>
</div>
</div>

<div id="outline-container-org68b9231" class="outline-2">
<h2 id="org68b9231">Local Notes</h2>
<div class="outline-text-2" id="text-org68b9231">
<ol class="org-ol">
<li>Village Population / Details:</li>
<li>Major FoodCrops:</li>
<li>Local Culture / People:</li>
</ol>
</div>
</div>

<div id="outline-container-org8672f61" class="outline-2">
<h2 id="org8672f61">Photos &amp; Media</h2>
<div class="outline-text-2" id="text-org8672f61">
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Add photos</li>
<li class="off"><code>[&#xa0;]</code> Add route map (GPS screenshot)</li>
<li class="off"><code>[&#xa0;]</code> Add group photo</li>
</ol>
</div>
</div>

<div id="outline-container-org5853ccc" class="outline-2">
<h2 id="org5853ccc">Reflection</h2>
<div class="outline-text-2" id="text-org5853ccc">
<ol class="org-ol">
<li>What I Loved Most:</li>
<li>What I’d Improve Next Time:</li>
<li>Recommend To:</li>
<li>Return Visit:</li>
<li class="off"><code>[&#xa0;]</code> yes/no</li>
<li class="off"><code>[&#xa0;]</code> (why?)</li>
</ol>


<ul class="org-ul">
<li>Region: Near Nashik, reforested hill and forest area.[web:7][web:11]</li>
<li>Height: ~3480 ft (approx summit ridge).</li>
<li>Grade: Easy; usually done as a jungle walk/safari rather than a summit push.</li>
<li>Route: Entry point → forest track → viewpoints over reforested slopes and small water bodies; specific paths vary by guide and permission.</li>
<li>Access: Close to Nashik city; access only through organised groups and with special permission due to proximity to restricted areas.</li>
<li>Best season: Post-monsoon for full green cover.</li>
<li>Water/food: Treat as a half-day walk but still carry water and light snacks.</li>
<li>Safety: Area touches sensitive/IAF-linked zones; always respect boundaries, follow guides, and avoid off-trail wandering.</li>
<li>Fact: Around 1.5–2.5 lakh trees have been planted here over years as part of major afforestation drives, transforming the hill’s biodiversity.[web:7][web:11]</li>
<li>Quote: “Borgad is a reminder that forests can be destroyed by people—and also rebuilt by people.”</li>
</ul>
</div>
</div>
</div>
</body>
</html>